{
  "pokemon": [{
    "id": 1,
    "num": "001",
    "name": "Liliana",
    "img": "https://raw.githubusercontent.com/ketthidarat/flutterProject/master/liliana.png",
    "type": [
      "เมจ/แอสซาซิน"
    ],
    "height": "Nine-tailed fox",
    "weight": "Liliana เป็นเมจที่ค่อนข้างครบเครื่องและมีสกิลให้ใช้งานหลากหลายมาก จุดเด่นของเธอคือสามารถแปลงร่างเป็นจิ้งจอกเก้าหางได้ ซึ่งในระหว่างแปลงร่างสกิลของเธอจะเปลี่ยนไป เรียกได้ว่าตัวเธอนั้นมีสกิลให้ใช้งานกันถึง 6 สกิลเลยทีเดียว ในแต่ละร่างก็จะมีบทบาทแตกต่างกัน สำหรับในร่างของคนจะเป็นเมจที่สามารถโจมตีได้จากระยะที่ค่อนข้างไกล และร่างจิ้งจอกเก้าหางจะมีความสามารถไปในทางสายแอสซาซิน ที่สามารถเข้าหรือถอยได้ไว",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "Fox Form",
      "Shining Light",
      "Unpredictable"
    ],
    "next_evolution": [{
      "num": "001",
      "name": "ว่องไว/ฟาร์ม"
    }]
  }, {
    "id": 2,
    "num": "002",
    "name": "Diao chan",
    "img": "https://raw.githubusercontent.com/ketthidarat/flutterProject/master/diao.png",
    "type": [
      "เมจ"
    ],
    "height": "The Crystal Lotus",
      "weight": "Diao chan เป็นฮีโร่เมจตัวใหม่ที่มีความรุนแรงสูง ทั้ง CC และ ดาเมจอยู่ในระดับตัวทอปของตำแหน่งเมจเลยทีเดียว ซึ่งใครได้จับเธอไปเล่นแล้วล่ะก็นอกจากจะถูกใจในรุปร่างและความสวยงามของเธอยังติดใจในการใช้งานในทีมไฟต์อีกด้วย",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "Chilling Frost",
      "Absolute Zero",
      "Blizzard"
    ],
    "next_evolution": [{
      "num": "002",
      "name": "ควบคุม"
    }]
  },{
    "id": 3,
    "num": "003",
    "name": "Annette",
    "img": "https://raw.githubusercontent.com/ketthidarat/flutterProject/master/annette.png",
    "type": [
      "ซัพพอร์ต/เมจ"
    ],
    "height": "The Diviner",
    "weight": "Annette มีสกิล AOE (สกิลวางพื้น) ถึงสองสกิล จึงค่อนข้างเล่นง่าย อีกทั้งยังมีสกิลที่มี CC ถึง 2 สกิลด้วยกัน รวมถึงสกิล Passive ที่สามารถช่วยเพื่อนในยามคับขันได้",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "Gust Force",
      "Wind Cuffs",
      "Hurricane Wall"
    ],
    "next_evolution": [{
      "num": "003",
      "name": "สนับสนุนทีม"
    }]
  },{
    "id": 4,
    "num": "004",
    "name": "Ilumia",
    "img": "https://raw.githubusercontent.com/ketthidarat/flutterProject/master/illumia.png",
    "type": [
      "เมจ"
    ],
    "height": "The High Goddess",
    "weight": "Ilumia ผู้มีสกิลทั่วแมพเพียงหนึ่งเดียวในเกม ถือว่าเป็นเมจสาวที่มีสกิล CC ค่อนข้างเยอะ อีกทั้งยังมีสกิลที่ช่วยชีวิต คือสกิล 2 ที่ผลักศัตรูออกจากตัวของเธอ และมี Passive ที่ช่วยส่งเสริมให้สกิล 1 มีประสิทธิภาพมากขึ้น Ilumia จึงเป็นเมจซัพพอร์ทที่มีสกิลช่วยเพื่อนที่ดีตัวหนึ่ง",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "Divine Light",
      "Banish",
      "Catalysm"
    ],
    "next_evolution": [{
      "num": "004",
      "name": "ควบคุม/ระยะไกล"
    }]
  },{
    "id": 5,
    "num": "005",
    "name": "Krixi",
    "img": "https://raw.githubusercontent.com/ketthidarat/flutterProject/master/krixi.png",
    "type": [
      "เมจ"
    ],
    "height": "The Pixie",
    "weight": "Krixi เป็นฮีโร่สายเวทย์ ซึ่งแน่นอนว่าตัวของเธอก็จะเปราะบาง ไม่ควรเอาไปยืนบวกกับใคร ควรอยู่แนวหลังคอยตามเพื่อนถึงจะดี ตัวนี้สามารถทำดาเมจได้ดีมากๆ ด้วยสกิลผีเสื้อ Flutter (สกิลแรก) เพราะมีรัศมีที่กว้าง แถมเมื่อปล่อยออกไปแล้ว มันยังบินวนกลับมาทำดาเมจได้อีก เท่ากับสร้างดาเมจได้ 2 เด้งทั้งไปและกลับ เป็นสกิลที่น่ากลัวมากๆ แถมสกิล 2 (Nature's Wrath) ยังยก+สตั๊นได้อีก ถ้าใช้เป็นคอมโบ สตั๊น+ยิงผีเสื้อ ล่ะก็ ศัตรูได้หงายเงิบแน่ๆ นอกจากนี้ด้วยสกิลแรกยังสามารถช่วยเคลียร์ครีปได้เป็นอย่างดี จึงเป็นตัวที่เหมาะกับการลุยเคลียร์เลนดันป้อมด้วยเช่นกัน",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "Mischief",
      "Nature's Wrath",
      "Moonfall"
    ],
    "next_evolution": [{
      "num": "005",
      "name": "ระยะไกล"
    }]
  },{
    "id": 6,
    "num": "006",
    "name": "ราศีกันย์",
    "img": "https://raw.githubusercontent.com/chadaporn29797/tiktry/master/d9.png",
    "type": [
      "ผู้ที่อยู่ในราศีนี้นิยมใช้สติปัญญามากกว่าสัญชาตญาณ มีความอ่อนเยาว์ ร่าเริง และเบิกบานตามธรรมชาติเช่นเดียวกับเด็กเล็กๆ มีความสามารถในการดูคน และยังสามารถจูงใจคนให้ทบทวนทัศนคติและความเชื่อของตนเองใหม่ได้ด้วย คนราศีนี้เป็นคนว่าไงว่ากัน ไม่ค่อยแข็งข้อ ถือเป็นตัวอย่างของการเริ่มต้นและเปลี่ยนแปลงใหม่ได้เสมอ ในด้านระบบร่างกาย ดาวพุธเชื่อมโยงกับกระบวนการทางความคิดและสติปัญญา รวมถึงต่อมไทรอยด์ด้วย"
    ],
    "height": "17 ก.ย. - 17 ต.ค.",
    "weight": "ราศีกันย์อยู่ใต้อิทธิพลของดาวพุธหรือเมอร์คิวรี (Mercury)  เช่นเดียวกับผู้ที่อยู่ในราศีเมถุน เมอร์คิวรีเป็นเทพแห่งการสื่อสารตามตำนานของชาวโรมัน มีของวิเศษเป็นรองเท้าและหมวกมีปีก ถือเป็นตัวแทนของอุปนิสัยที่รู้จักปรับตัว ยืดหยุ่น และใช้สิ่งที่มีอยู่ให้เกิดประโยชน์ บุคลิกของผู้ที่เกิดภายใต้ราศีนี้ เป็นคนที่ทำตามแนวคิดและศีลธรรมตามแบบที่สอดคล้องกับสังคมในยุคสมัยนั้นๆ",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "ดอกลิลลี่",
      "วอลนัท",
      "นกแก้ว",
      "หินโมรา"
    ],
    "next_evolution": [{
      "num": "006",
      "name": "ดาวพุธ"
    }]
  },{
    "id": 7,
    "num": "007",
    "name": "ราศีตุลย์",
    "img": "https://raw.githubusercontent.com/chadaporn29797/tiktry/master/d10.png",
    "type": [
      "ผู้ที่อยู่ภายใต้ดาวศุกร์เป็นคนชอบความสะดวกสบาย และพยายามทำทุกอย่างเพื่อวัตถุประสงค์นี้ คนราศีตุลย์เป็นคนรักบ้าน และมักมีกลุ่มเพื่อนที่คบกันไปตลอดชีวิต แต่คนราศีนี้ก็มีข้อเสียเช่นกัน นั่นก็คือ มักมีอุปนิสัยที่แสดงถึงการขาดความนิ่งสงบ เมื่อเกิดข้อขัดแย้งมักใช้อารมณ์มากเกินไป แม้เรื่องเล็กๆ น้อยๆ ก็ทำให้ตึงเครียดอย่างมากได้ ความเข้าใจผิดจึงเกิดขึ้นง่าย หากไม่เลือกมิตรสหายที่เข้าใจกันดีมาตั้งแต่ต้น"
    ],
    "height": "18 ต.ค. - 16 พ.ย.",
    "weight": "ราศีตุลย์ ซึ่งอยู่ภายใต้อิทธิพลของวีนัสหรือดาวศุกร์ กลุ่มดาวแห่งความงาม เช่นเดียวกับผู้ที่เกิดในราศีพฤษภ ในตำนานของชาวโรมัน วีนัสถือเป็นเทพธิดาแห่งความรักและความงาม ชาวราศีตุลย์เป็นคนสอดคล้องกับธรรมชาติ ชอบแสวงหาความสุขและมิตรภาพ เป็นคนงดงาม มีเสน่ห์ รักเสียงเพลง และชอบความเบิกบานใจ",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "ดอกแดฟโฟดิล",
      "โลมา",
      "หงส์",
      "คาร์เนเลียน"
    ],
    "next_evolution": [{
      "num": "007",
      "name": "ดาวศุกร์"
    }]
  },{
    "id": 8,
    "num": "008",
    "name": "ราศีพิจิก",
    "img": "https://raw.githubusercontent.com/chadaporn29797/tiktry/master/d11.png",
    "type": [
      "อิทธิพลจากพลูโตเชื่อมโยงกับลักษณะแห่งการเปลี่ยนแปลง ส่งผลให้คนราศีพิจิก มีทั้งอำนาจ ความสำเร็จเฉพาะบุคคลและต้องการความร่วมมือและแบ่งปันกับผู้อื่น นอกจากนี้ดาวพลูโตยังมีส่วนเกี่ยวข้องอย่างแน่นแฟ้นกับอำนาจ รวมถึงยังมีความเชื่อว่า ดาวที่ส่งผลต่อราศีพิจิกนอกจากจะมีดาวพลูโตแล้ว ยังมีดาวอังคารด้วย ส่งผลให้คนที่เกิดในราศีนี้มีคุณลักษณะที่เด่นชัดในด้านพรสวรรค์ เสน่ห์อันลึกลับ ความน่าเชื่อถือ ความอดทน ความอยากรู้อยากเห็น ช่างสงสัย ยืดหยุ่น แต่ในทางลบก็อาจส่งผลในทางทำลายตัวเองได้ คนราศีนี้ต้องการเป็นผู้ควบคุมทุกสิ่ง โดยเฉพาะเรื่องความรัก"
    ],
    "height": "17 พ.ย. - 15 ธ.ค.",
    "weight": "ราศีลำดับที่ 8 ในจักรราศี มีเทพพลูโตเป็นเทพประจำราศี พลูโตถือเป็นเทพแห่งความมั่งคั่ง ผู้ครองยมโลกตามตำนานของชาวโรมัน ดาวพลูโตใช้เวลาโคจรรอบดวงอาทิตย์ประมาณ 248 ปีตามเวลาโลก ได้รับฉายาว่าเป็นดาวดาวเคราะห์แคระ ",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "กระเทียม",
      "หัวหอม",
      "สีดำ",
      "สีน้ำตาลแดง"
    ],
    "next_evolution": [{
      "num": "008",
      "name": "ดาวพลูโต"
    }, {
      "num": "008",
      "name": "ดาวอังคาร"
    }]
  },{
    "id": 9,
    "num": "009",
    "name": "ราศีธนู",
    "img": "https://raw.githubusercontent.com/chadaporn29797/tiktry/master/d12.png",
    "type": [
      "คนในราศีนี้มีแนวโน้มให้ความสำคัญกับอิสรภาพ และมีแรงปรารถนาในการสำรวจและค้นพบ เชื่อมโยงไปจนถึงเรื่องที่ต้องเกี่ยวข้องกับต่างประเทศ ไม่ว่าจะเป็นการเดินทาง การศึกษา ศาสนา และกฎหมาย คนราศีธนูยังมีคุณสมบัติเด่นในเรื่องสติปัญญา น้ำใจ การแข่งขัน การแสดงออก ความปรารถนา และการเป็นนักสื่อสารที่ดี เป็นต้น ในด้านที่สุดโต่ง คนราศีนี้มักขี้กระวนกระวายมากและชอบการเปลี่ยนแปลง"
    ],
    "height": "16 ธ.ค. - 14 ม.ค.",
    "weight": "ราศีธนูเป็นราศีที่อยู่ภายใต้อิทธิพลของดาวพฤหัสหรือจูปิเตอร์ ตามตำนานเทพเจ้าโรมันเชื่อกันว่า จูปิเตอร์ คือผู้ปกครองเหนือบรรดาทวยเทพ (มีชื่อภาษากรีกคือ ซุส) โดยการโค่นเทพแห่งดาวเสาร์หรือโครนัส (ซึ่งเป็นพ่อของตัวเอง) ลง จูปิเตอร์มีบทบาทเป็นทั้งผู้พิทักษ์และผู้ปกป้อง มีสัญลักษณ์ประจำตัวเป็นอสุนีบาต ในระบบสุริยจักรวาล",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "หน่อไม้ฝรั่ง",
      "ผลไม้แห้ง",
      "เกาลัด",
      "สีคราม"
    ],
    "next_evolution": [{
      "num": "009",
      "name": "ดาวพฤหัส"
    }]
  },{
    "id": 10,
    "num": "010",
    "name": "ราศีมังกร",
    "img": "https://raw.githubusercontent.com/chadaporn29797/tiktry/master/d1.png",
    "type": [
      "เป็นคนขี้กังวลเกี่ยวกับอนาคตและการวางแผนในระยะยาว ในด้านระบบร่างกาย ดาวเสาร์เชื่อมโยงกับโครงสร้างด้านโครงกระดูก ผิวหนัง ฟัน ถุงน้ำดี ม้าม และเส้นประสาทเวกัส ในช่วงเวลาก่อนการค้นพบดาวยูเรนัสในสุริยจักรวาลนั้น ดาวเสาร์นอกจากจะเป็นดาวประจำราศีมังกรแล้ว ยังเป็นดาวประจำราศีกุมภ์ด้วย ซึ่งนักโหราศาสตร์ส่วนใหญ่ก็ยังเชื่อเช่นนั้นมาจนถึงทุกวันนี้"
    ],
    "height": "15 ม.ค. - 12 ก.พ.",
    "weight": "ราศีมังกรเป็นราศีที่อยู่ภายใต้อิทธิพลของดาวเสาร์ มีสัญลักษณ์เป็นครึ่งแพะภูเขาครึ่งปลา ตามความเชื่อของโรมันถือเป็นเทพเจ้าแห่งเกษตรกรรม ผู้สร้างอารยธรรม ผู้จัดระเบียบทางสังคมและสร้างความสมานฉันท์",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "ต้นเอลเดอร์",
      "ดอกเบอร์ดอค",
      "สีเอิร์ธโทน",
      "สีส้ม"
    ],
    "next_evolution": [{
      "num": "010",
      "name": "ดาวเสาร์"
    }]
  },{
    "id": 11,
    "num": "011",
    "name": "ราศีกุมภ์",
    "img": "https://raw.githubusercontent.com/chadaporn29797/tiktry/master/d2.png",
    "type": [
      "เป็นราศีแห่งมิตรภาพและวาสนา คุณจะมีเพื่อนมากมาย แม้คุณจะดูเหมือนคนธรรมดาทั่วไปแต่ก็มักถูกห้อมล้อมด้วยบุคคลที่ไม่ธรรมดาอยู่เสมอ คุณรู้วิธีที่จะก้าวถอยหลังและหาลู่ทางเพื่อแก้ปัญหาได้อย่างสมบูรณ์แบบเสมอ คุณสร้างมิตรภาพได้กับทุกคน ขณะเดียวกันก็ชอบทำให้คนเซอร์ไพรส์กับไอเดียสุดล้ำอยู่เสมอ เมื่อคนจับไต๋คุณได้ คุณก็เปลี่ยนเกม"
    ],
    "height": "14 ก.พ. - 14 มี.ค.",
    "weight": "ราศีกุมภ์เป็นราศีที่อยู่ภายใต้อิทธิพลของดาวยูเรนัส ตัวแทนแห่งสวรรค์และท้องฟ้ายามราตรี ตามความเชื่อของเทพปกรณัมกรีก ดาวที่เป็นตัวแทนแห่งราศีกุมภ์นี้ มีความโดดเด่นแตกต่าง เนื่องจากมีการหมุนไปในทิศทางตรงกันข้ามกับดาวเคราะห์ดวงอื่น นั่นคือหมุนตามเข็มนาฬิกา และด้วยระนาบการวางตัวกับระบบสุริยะ",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "มะเดื่อ",
      "แอปเปิล",
      "มะนาว",
      "สีฟ้าน้ำเงิน"
    ],
    "next_evolution": [{
      "num": "011",
      "name": "ดาวยูเรนัส"
    },{
      "num": "011",
      "name": "ดาวเสาร์"
    }]
  },{
    "id": 12,
    "num": "012",
    "name": "ราศีมีน",
    "img": "https://raw.githubusercontent.com/chadaporn29797/tiktry/master/d3.png",
    "type": [
      "สัญลักษณ์ของราศีมีนคือรูปปลาสองตัว ว่ายวนในทิศทางตรงกันข้าม สะท้อนถึงความต้องการด้านหนึ่งของคุณที่อยากจะหนีออกจากโลกความเป็นจริง ขณะที่อีกด้านหนึ่งลางสังหรณ์อันว่องไวของคุณ ก็มักดึงคุณเข้าไปเกี่ยวข้องกับทุกอย่าง แต่ไม่ว่าคุณจะต้องการก้าวออกมาจากอะไรก็ตาม จินตนาการคือพื้นที่ลี้ภัยที่ดีที่สุดของคุณ คุณเป็นคนชอบเต้น"
    ],
    "height": "15 ม.ค. - 12 ก.พ.",
    "weight": "ราศีมีนเป็นลำดับสุดท้ายในจักรราศี อยู่ภายใต้อิทธิพลของดาวเนปจูน ซึ่งตามตำนานของชาวโรมัน เนปจูนเป็นเทพเจ้าแห่งทะเลและที่ลึก สีน้ำเงินเข้มของดาวเคราะห์ดวงนี้สะท้อนความเชื่อที่ว่าได้อย่างสมบูรณ์แบบ ",
    "candy": "Bulbasaur Candy",
    "candy_count": 25,
    "egg": "2 km",
    "spawn_chance": 0.69,
    "avg_spawns": 69,
    "spawn_time": "20:00",
    "multipliers": [1.58],
    "weaknesses": [
      "ดอกไอริส",
      "ดอกบัว",
      "สีเงิน",
      "สีเขียวน้ำทะเล"
    ],
    "next_evolution": [{
      "num": "012",
      "name": "ดาวเนปจูน"
    },{
      "num": "012",
      "name": "ดาวพฤหัส"
    }]
  }
]
}
